import './App.css'
import Demo from "./components/dialog/Dialog.jsx"

function App() {
    const movies = [
        {
            title: "Побег из Шоушенка",
            description: "История банкира, несправедливо осуждённого за убийство, который находит надежду и свободу в тюрьме Шоушенк."
        },
        {
            title: "Интерстеллар",
            description: "Группа учёных отправляется в космос, чтобы найти новую пригодную для жизни планету, пока Земля умирает."
        },
        {
            title: "Начало",
            description: "Профессиональный вор внедряется в сны людей, чтобы украсть или внедрить идеи прямо в подсознание."
        },
        {
            title: "Матрица",
            description: "Хакер Нео обнаруживает, что мир вокруг — это симуляция, и он должен спасти человечество."
        },
        {
            title: "Форрест Гамп",
            description: "Трогательная история доброго, но простоватого мужчины, невольно ставшего участником ключевых событий XX века."
        }
    ];

  return (
    <>
      <Demo films = {movies}/>
    </>
  )
}

export default App
